
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7571736775)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/6416747b-caf6-4441-951b-dfadb31ac811/terraform-bin apply -input=false -auto-approve -lock=false -no-color
google_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]
google_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-cloudstorage: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]
google_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_network.shared-test will be created
  + resource "google_compute_network" "shared-test" {
      + auto_create_subnetworks                   = true
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "shared-test-2"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + numeric_id                                = (known after apply)
      + project                                   = "gig-japan-398904"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
google_compute_network.shared-test: Creating...
google_compute_network.shared-test: Still creating... [10s elapsed]
google_compute_network.shared-test: Still creating... [20s elapsed]
google_compute_network.shared-test: Still creating... [30s elapsed]
google_compute_network.shared-test: Still creating... [40s elapsed]
google_compute_network.shared-test: Still creating... [50s elapsed]
google_compute_network.shared-test: Creation complete after 52s [id=projects/gig-japan-398904/global/networks/shared-test-2]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
::debug::Terraform exited with code 0.
::debug::stdout: google_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]%0Agoogle_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-cloudstorage: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]%0Agoogle_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # google_compute_network.shared-test will be created%0A  + resource "google_compute_network" "shared-test" {%0A      + auto_create_subnetworks                   = true%0A      + delete_default_routes_on_create           = false%0A      + gateway_ipv4                              = (known after apply)%0A      + id                                        = (known after apply)%0A      + internal_ipv6_range                       = (known after apply)%0A      + mtu                                       = (known after apply)%0A      + name                                      = "shared-test-2"%0A      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"%0A      + numeric_id                                = (known after apply)%0A      + project                                   = "gig-japan-398904"%0A      + routing_mode                              = (known after apply)%0A      + self_link                                 = (known after apply)%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0Agoogle_compute_network.shared-test: Creating...%0Agoogle_compute_network.shared-test: Still creating... [10s elapsed]%0Agoogle_compute_network.shared-test: Still creating... [20s elapsed]%0Agoogle_compute_network.shared-test: Still creating... [30s elapsed]%0Agoogle_compute_network.shared-test: Still creating... [40s elapsed]%0Agoogle_compute_network.shared-test: Still creating... [50s elapsed]%0Agoogle_compute_network.shared-test: Creation complete after 52s [id=projects/gig-japan-398904/global/networks/shared-test-2]%0A%0AApply complete! Resources: 1 added, 0 changed, 0 destroyed.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform_apply","PRNumber":3,"Program":"tfcmt","SHA1":"bde296ad620e491566c21c7511484649f53c7887","Vars":{},"WorkflowName":"iaac_apply"} -->